Web应用建构和性能测试
一、系统功能定义：
据用户种类分为三个部分：管理员管理、教师管理、学生管理。各部分功能需求如下。

管理员功能：
（1）学生端
·注册用户和登陆：学生可自由地注册用户并登陆在线答疑系统
·资料修改与密码修改：注册后的学生可以修改自己的资料和密码
·查询问题：可查看所有问题，也可以采用模糊搜索搜索已存在的问题，和相应的回答
·查看参与的提问：学生可以查看自己所有参与的问题并可以追加提问。
·新建提问：学生通过可以新建一个问题，并选择回答对象。

（2）教师端
·查看未回答的问题：登陆后，教师可以查看未回答问题列表
·查看已回答问题：对于已回答的问题可以继续追加回答
·资料上传：可以上传相关的学习资料
·收藏问题：教师可以收藏一些好的提问，并可以下载。
·提问：老师也可以对同学们提出问题。

（3）管理端
·用户管理：管理教师用户和学生用户，可以重置用户的密码
·内容管理：管理员可以对提问内容和回复内容进行管理。
·管理员管理：超级用户对一般管理员的管理
·禁止操作：对不合法或者言语攻击等的用户进行禁言或者删除用户操作。

二．具体窗口操作
管理员登录窗口：
窗口中放置了2个静态文本框，在相应的位置显示文字。放置了两个编辑框控件，分别供管理员输入账户和密码登入口令。如果密码正确则可以打开并进入程序。
登入系统以后，管理员可以在左边的导航栏进行对所有学生和老师的信息的查询，点击在线公告、问题提交和问题回复等，可以对其进行查询、修改和删除。
并且可以处理一些具有严重问题或者恶意提交的问题或者回复，并对相应的用户进行对应的惩罚，点击账户管理可以对个人信息和密码进行修改。

添加公告栏窗口:
这个窗口主要是老师及时发布的公告，使得学生能及时得知，便于老师和学生的交流和沟通。当老师需要发布公告的时候，教师就可以登入自己的账号，到在线公告栏填写公告标题和内容，点击上传就可以发布了。

学生提交问题窗口:
这个窗口主要用于学生提交问题以及附件，当学生登入自己的账号之后，点击提问问题，就可以对问题的主题和内容进行编辑，点击确认就可以发送到系统中，可以添加小的文本附件。

教师解答问题窗口:
这个窗口主要用于老师回复学生提交的问题，老师登入自己的账号之后，点击回复问题，就可以查看当前都有一些什么问题，根据自己的教学方向，系统会自动对问题类型分类，只显示于老师相关的问题，老师看到需要回答的问题以后，点击该问题，就可以对该问题进行回复，在教师回答问题以后，学生也可以在该界面对问题进行追问，老师也可以继续作答，方便老师与学生交流和沟通。

历史问题查询窗口:
这个窗口同时适用于老师和学生，学生和老师都可以登入该页面，对历史已解决问题进行查询，学生可以快速找到答案，老师可以对问题解答进行补充。

还有学生和教师登录窗口、密码更改窗口等这里就不再赘述了。

三、性能测试
1.测试目的：
在该阶段主要是对应用程序进行调试，排除存在的逻辑错误。

2.具体测试：
登录测试：
当输入正确的账号和密码时，教师可以正常登入。
当输入错误的账号时，教师无法正常登录，系统返回账号不存在。
当输入错误的密码时，教师无法正常登录，系统返回密码错误。

信息修改测试：
当成功登入后，在点击个人信息
学生、教师的姓名和编号是唯一确定的，不能更改。
对性别、昵称、密码、所在学院和联系方式是可以进行更改的。
例如将性别从“男”改成“女”，系统会提示修改成功。
如果有特殊情况需要更改编号和姓名则需要联系管理员，以管理员的身份可以进行更改。

发布公告测试：
当成功上传公告时，系统提示：恭喜！您已成功发布公告。
如果内容或者标题没有填写，系统提示：请返回填写详细资料。

问题提交测试：
当成功上传问题时，系统提示：您已成功提交问题，请耐心等待老师回答。
当内容填写不完整时，系统提示：您提交的问题不完善，请完成填写再提交。

问题回答测试：
当问题成功回复时，系统提示：您已成功回复问题，老师辛苦了！ 。
当问题回复内容不完整是，系统提示：您回复的问题不完善，请完成回复再提交。

历史问题查询测试：
通过点击具体问题可以进行正常查看。
如果需要追问或者补充回答，当成功发送时，系统提示：追问（补充）成功！
如果内容没有填写完整，系统提示：追问（回答）失败，请重新提交。

3.测试总结：
通过测试，数据库操作正常，系统功能达到任务书要求，满足了在线答疑的需求，各模块功能正常。
